lgstoian/p4minishell/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.5.5 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32p4"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y

CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_USE_TICKLESS_IDLE=y
CONFIG_FREERTOS_VTASKLIST_INCLUDE_COREID=y
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y
# Background `start` jobs run on PSRAM stacks via xTaskCreateStatic (32 KB
# internal stacks no longer fit at runtime); without this, bg pool creation
# silently falls back to internal and fails.
CONFIG_FREERTOS_TASK_CREATE_ALLOW_EXT_MEM=y

CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_PM_ENABLE=y
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# app_main builds the full LVGL UI (windows_init -> transcript/input/keyboard
# creation + transcript mirror printf) on the main task AND runs the DOS boot
# scripting (CONFIG.SYS / AUTOEXEC.BAT) through the recursive batch pipeline,
# which dispatches every line through shell_execute_command -> segment -> core.
# The 3584-byte default overflowed in vfprintf during shell_build_ui, and 8192
# overflowed in the same machinery once boot scripting plus the shell's
# argument-cap and echo hardening added frames on that path. 16384 gives the
# boot path comfortable headroom for nested batch files.
# Box-drawing/symbol font for the TUI (managed_components in-tree extended
# unscii_16, 384 glyphs). NOTE: if the generated sdkconfig ever shows this
# as "not set", delete the generated sdkconfig and rebuild so defaults
# re-apply — a stale generated file silently disables the font and the TUI
# falls back to ASCII tofu (seen on hardware 2026-09-06).
CONFIG_LV_FONT_UNSCII_16=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384

# Phase-3 SD fonts: tiny_ttf (bundled stb rasterizer, no freetype dep) with
# file support. The LVGL FATFS driver is NOT used (it would need a managed
# CMakeLists edit for its ff.h dep); components/font registers its own tiny
# "F:" lv_fs driver over stdio/VFS instead. Built-in bitmaps stay compiled
# regardless; TTFs are strictly optional.
CONFIG_LV_USE_TINY_TTF=y
CONFIG_LV_TINY_TTF_FILE_SUPPORT=y

# Wi-Fi/IP event handlers call the shell transcript (vsnprintf formatting) and
# header notify hooks directly on the esp_event `sys_evt` task. The 2304-byte
# default overflows with a stack protection fault in the vfprintf machinery
# right after esp_wifi_start(); 16384 gives the handler path real headroom and
# margin for the hosted RPC/event dispatch (esp_hosted 3.0.6).
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=16384


# ESP-Hosted on ESP32-P4 with ESP32-C6 co-processor over SDIO
CONFIG_ESP_HOSTED=y
CONFIG_SLAVE_IDF_TARGET_ESP32C6=y
CONFIG_ESP_HOSTED_HOST=y
CONFIG_ESP_HOSTED_HOST_TRANSPORT_BUS_SDIO=y
CONFIG_ESP_HOSTED_HOST_SDIO_SLOT=1
CONFIG_ESP_HOSTED_HOST_SDIO_BUS_WIDTH_4=y
CONFIG_ESP_HOSTED_HOST_SDIO_CLK_KHZ=40000
CONFIG_ESP_HOSTED_HOST_SDIO_PIN_CLK=18
CONFIG_ESP_HOSTED_HOST_SDIO_PIN_CMD=19
CONFIG_ESP_HOSTED_HOST_SDIO_PIN_D0=14
CONFIG_ESP_HOSTED_HOST_SDIO_PIN_D1=15
CONFIG_ESP_HOSTED_HOST_SDIO_PIN_D2=16
CONFIG_ESP_HOSTED_HOST_SDIO_PIN_D3=17
CONFIG_ESP_HOSTED_HOST_RESET_GPIO=54
CONFIG_ESP_HOSTED_HOST_CP_RESET_STRATEGY_ALWAYS=y
CONFIG_ESP_HOSTED_HOST_CP_BRINGUP_ON_TIMEOUT_NONE=y
CONFIG_ESP_HOSTED_HOST_TRANSPORT_RESTART_ON_FAILURE=n
# Preserve internal RAM (shared with LVGL) by placing hosted DMA transport
# buffers in PSRAM first. The esp_hosted SDIO/scan paths have historically
# overrun internal-RAM heap metadata (W1); isolating their allocations in
# PSRAM keeps any overrun away from the LVGL timer/object lists.
CONFIG_EH_HOST_PORT_DMA_PREFER_SPIRAM=y
CONFIG_BT_ENABLED=y
CONFIG_BT_CONTROLLER_DISABLED=y
CONFIG_BT_BLUEDROID_ENABLED=n
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_TRANSPORT_UART=n
CONFIG_ESP_HOSTED_HOST_FEAT_BT=y
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=255
CONFIG_FATFS_USE_LABEL=y
CONFIG_FATFS_API_ENCODING_UTF_8=y

# USB host defaults required by the local usb component override.
CONFIG_USB_HOST_CONTROL_TRANSFER_MAX_SIZE=256
CONFIG_USB_HOST_HW_BUFFER_BIAS_BALANCED=y
CONFIG_USB_HOST_DEBOUNCE_DELAY_MS=250
CONFIG_USB_HOST_RESET_HOLD_MS=30
CONFIG_USB_HOST_RESET_RECOVERY_MS=30
CONFIG_USB_HOST_SET_ADDR_RECOVERY_MS=10
CONFIG_USB_HOST_RESUME_HOLD_MS=30
CONFIG_USB_HOST_RESUME_RECOVERY_MS=20
CONFIG_USB_HOST_SUSPEND_ENTRY_MS=20
CONFIG_USB_OTG_SUPPORTED=y

# Station-only Wi-Fi profile. The networking module always calls
# esp_wifi_set_mode(WIFI_MODE_STA); disabling SoftAP support here makes the
# constraint structural rather than conventional, and reclaims the AP code
# path from the image.
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=n
# esp_wifi_remote mirrors the Wi-Fi Kconfig under its own WIFI_RMT_ prefix, and
# on the hosted path that mirror is the one that matters. Both must be set.
CONFIG_WIFI_RMT_SOFTAP_SUPPORT=n

# Image-budget constraints. These were previously only in the generated
# sdkconfig, so regenerating it silently reverted them to the ESP-IDF defaults
# and grew the image. Pinning them here makes them durable.
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_LOG_DEFAULT_LEVEL_WARN=y
# LVGL demos/examples must stay off: the esp32p4 image budget has no room
# for them (see ai-context.md build constraints).
# CONFIG_LV_USE_DEMO_MUSIC is not set
# CONFIG_LV_USE_DEMO_KEYPAD_AND_ENCODER is not set
# CONFIG_LV_USE_DEMO_BENCHMARK is not set
# CONFIG_LV_USE_DEMO_STRESS is not set
# CONFIG_LV_USE_DEMO_WIDGETS is not set

# PSRAM XIP instruction/rodata mapping must stay disabled: enabling it
# overflows the flash/PSRAM budget at link time on this board.
CONFIG_SPIRAM_XIP_FROM_PSRAM=n

# Reduce internal heap pressure: with the default 16384, even 100-byte LVGL
# spans prefer internal first and exhaust it under load (spans accumulate one
# per colour run per transcript line, so a single `dir /S` can need tens of
# KB; newlib then aborts in lock_init_generic when a snprintf needs a mutex).
# 0 sends plain malloc() to PSRAM first (DMA users request explicit caps and
# are unaffected; malloc falls back to internal when PSRAM is full), while the
# 32 KB RESERVE pool stays dedicated to DMA/internal-required allocations.
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=0
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768

# On RISC-V the IDF default backtrace method is "None", which hides the call
# stack on a panic. Enable unwinding so crash reports include a real
# backtrace for triage on hardware.
CONFIG_ESP_SYSTEM_USE_EH_FRAME=y

# Hold panics on screen for a few seconds instead of resetting instantly.
# The console is USB-Serial-JTAG, which drops the link during a reset; an
# instant reset would discard the backtrace before the host can read it.
CONFIG_ESP_SYSTEM_PANIC_REBOOT_DELAY_SECONDS=5

# Comprehensive heap poisoning turns silent heap corruption into a loud,
# attributed abort at free time. This board has shown intermittent LVGL/UI
# faults; keep the check on so a corrupting call site is named, not guessed.
CONFIG_HEAP_POISONING_COMPREHENSIVE=y

# Treat a task-watchdog timeout as a panic (with a decoded backtrace) instead
# of a silent reset, so a wedged task is attributable to the blocked frame.
CONFIG_ESP_TASK_WDT_PANIC=y

# Disable the LVGL default theme's style-transition animations. The theme
# starts an 80 ms transition animation on every style change; widgets that are
# restyled on every refresh (header, transcript, input line, keyboard) churn
# pending transitions, and under load (e.g. Bluetooth NimBLE init) the churned
# transition descriptors corrupt the LVGL pool - an intermittent fault in the
# transition start/completed callbacks dereferencing reused memory. Style
# changes become instant. Scroll, cursor, and interaction behaviour are
# unaffected (they are separate from style transitions).
CONFIG_LV_THEME_DEFAULT_TRANSITION_TIME=0

# Enable LVGL snapshot feature for the screenshot command.
# Required by the `screenshot` / `scr` / `capture` command to capture
# the current screen as a BMP image.
CONFIG_LV_USE_SNAPSHOT=y

# LVGL must use the standard C heap (CLIB malloc) instead of its built-in 64KB static pool.
# The transcript span group grows with every command; the 64KB built-in pool fills up and
# lv_malloc() returns NULL, which LV_ASSERT_MALLOC turns into an infinite loop that freezes the UI.
# With CLIB malloc, LVGL allocations use the system heap (ESP32-P4: PSRAM), so memory is effectively unbounded.
CONFIG_LV_USE_CLIB_MALLOC=y

# If an allocation ever fails, degrade gracefully (skip the span) instead of LVGL's
# LV_ASSERT_MALLOC infinite loop that freezes the UI. lv_span_set_text() already
# returns when the allocation is NULL.
# CONFIG_LV_USE_ASSERT_MALLOC is not set
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# TLS on this P4 build must allocate from PSRAM. The default internal-memory
# strategy leaves mbedTLS ~16KB short of internal RAM once the UI/network
# stacks are up, so every HTTPS connection fails at mbedtls_ssl_setup with
# MBEDTLS_ERR_SSL_ALLOC_FAILED (-0x7F00). With SPIRAM_USE_MALLOC enabled this
# places mbedTLS's record/handshake buffers in PSRAM (31MB free) and fixes
# `httpget https://...` and the C6 OTA TLS path.
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y

# The lwIP socket pool defaults to 10, which the HTTP server, ping, DNS, and
# short-lived HTTPS/TCP sessions can exhaust under a long networked session
# (socket() then fails until reset). Give it modest headroom. Do NOT raise it
# further: this build's internal RAM is tight enough at boot that 16 makes the
# 32KB command-worker task creation fail ("Failed to create command worker
# task"), bricking the shell. 12 has been verified to boot cleanly.
CONFIG_LWIP_MAX_SOCKETS=12

# TCP throughput: the 5760-byte default window caps a single stream at
# window/RTT over the ESP-Hosted link (~4-5 Mbit/s measured with the
# `wifi throughput` bench). Raise the window/send buffers and the receive
# mailbox so the SDIO/Wi-Fi transport, not the window, is the limit. lwIP
# allocates these from PSRAM here (CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP).
CONFIG_LWIP_TCP_WND_DEFAULT=32768
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=32768
CONFIG_LWIP_TCP_RECVMBOX_SIZE=32


# The on-board flash is a BOYA chip; enable its driver so the boot log does not
# warn about falling back to the generic driver.
CONFIG_SPI_FLASH_SUPPORT_BOYA_CHIP=y

# Boot-time Wi-Fi diagnostic scan is disabled by default. On earlier esp_hosted
# releases the scan path frequently corrupted heap metadata when it ran
# immediately after Wi-Fi start-up. Keep it off unless specifically debugging
# connectivity; the `wifi diag` command can still be run manually when needed.
# CONFIG_P4MINISHELL_WIFI_BOOT_DIAGNOSTIC is not set
